{
  "Syria": {
    "Shishbarak": {
      "ing": [
        "2 cups All-purpose flour",
        "500g Ground lamb or beef",
        "1kg Plain whole-milk yogurt",
        "1 tbsp Cornstarch (dissolved in 1/4 cup water)",
        "4 cloves Garlic (minced)",
        "1 bunch Fresh cilantro (chopped)",
        "1 tsp Allspice, salt, and black pepper",
        "1 tbsp Pine nuts (optional)"
      ],
      "step": [
        "Prepare the dough by mixing flour, water, and a pinch of salt. Let it rest for 30 mins.",
        "Sauté the meat with onions, allspice, salt, and pepper until browned. Mix in pine nuts.",
        "Roll out the dough thin and cut into small circles. Place a teaspoon of meat in each, fold into a half-moon, and pinch the corners together to make a hat shape.",
        "Whisk the yogurt with the dissolved cornstarch and a pinch of salt. Bring to a very gentle simmer while stirring constantly in one direction to prevent curdling.",
        "Drop the dough dumplings into the simmering yogurt and cook for 10-12 minutes.",
        "In a small pan, fry the garlic and cilantro in a little olive oil until fragrant, then pour it over the yogurt before serving."
      ]
    },
    "Shakria": {
      "ing": ["1kg Lamb shanks", "1kg Yogurt", "1 Egg", "2 Onions", "Cinnamon sticks", "Bay leaves"],
      "step": [
        "Boil the lamb with whole onions, cinnamon, and bay leaves until the meat falls off the bone.",
        "Strain the meat broth and save 1 cup of it.",
        "Whisk yogurt with an egg and cornstarch until perfectly smooth.",
        "Heat the yogurt slowly. Once simmering, add the cooked meat and the cup of broth.",
        "Cook on low heat for 15 minutes. Serve hot with vermicelli rice."
      ]
    },
    "Kibbeh Labanieh": {
      "ing": ["15 Prepared Kibbeh balls", "1kg Yogurt", "1 tbsp Dried mint", "3 cloves Garlic", "Cornstarch"],
      "step": [
        "Prepare the yogurt base (yogurt + cornstarch + water) and bring to a simmer.",
        "Gently drop the raw or pre-fried kibbeh balls into the yogurt.",
        "Simmer for 15 minutes until the kibbeh is cooked through.",
        "Sauté garlic in butter, add dried mint, and swirl into the pot at the very end."
      ]
    },
    "Yabrat (Grape Leaves)": {
      "ing": ["500g Grape leaves", "2 cups Short grain rice", "300g Minced meat", "Lamb chops (for the bottom of pot)", "6 cloves Garlic", "Lemon juice"],
      "step": [
        "Mix rice, minced meat, and spices. Stuff and roll the grape leaves tightly.",
        "Line the bottom of a heavy pot with lamb chops and garlic cloves.",
        "Stack the rolled leaves in neat layers. Add water, salt, and a plate on top to weigh them down.",
        "Simmer on low for 3-4 hours. Add lemon juice in the last 30 minutes of cooking."
      ]
    },
    "Mansaf (Syrian Style)": {
      "ing": ["1.5kg Lamb meat", "Jameed or Yogurt", "Rice", "Turmeric", "Toasted almonds", "Saj bread"],
      "step": [
        "Cook lamb in a broth of yogurt/jameed until extremely tender.",
        "Cook the rice with turmeric for a bright yellow color.",
        "Layer the saj bread on a large platter, soak with some yogurt broth, then pile the rice on top.",
        "Place the meat in the center and garnish with a generous amount of toasted almonds and parsley."
      ]
    }
  },
  "Italy": {
    "Classic Margherita Pizza": {
      "ing": ["500g Type 00 Flour", "325ml Warm water", "7g Yeast", "San Marzano tomatoes", "Fresh Mozzarella di Bufala", "Fresh Basil", "Extra virgin olive oil"],
      "step": [
        "Mix flour, yeast, and water. Knead for 10 minutes and let rise for at least 2 hours.",
        "Hand-stretch the dough into a circle. Do not use a rolling pin to keep the air in the crust.",
        "Spread a thin layer of crushed tomatoes and add chunks of fresh mozzarella.",
        "Bake in a very hot oven (250°C+) on a pizza stone if possible for 7-10 minutes.",
        "Finish with fresh basil leaves and a drizzle of high-quality olive oil."
      ]
    },
    "Authentic Carbonara": {
      "ing": ["200g Spaghetti", "150g Guanciale (cured pork cheek)", "3 Large egg yolks", "1 Whole egg", "60g Pecorino Romano cheese", "Freshly cracked black pepper"],
      "step": [
        "Boil spaghetti in salted water. Reserve half a cup of pasta water.",
        "Fry the guanciale until the fat renders and it becomes crispy. Remove from heat.",
        "In a bowl, whisk eggs, cheese, and a lot of black pepper until it forms a thick paste.",
        "Toss the hot pasta into the pan with the guanciale. Add the egg mixture and a splash of pasta water.",
        "Vigorously stir away from the heat so the eggs create a creamy sauce without scrambling.",
        "Serve immediately with extra cheese on top."
      ]
    },
    "Eggplant Parmigiana": {
      "ing": ["2 Large eggplants", "Tomato passata", "Mozzarella", "Parmesan cheese", "Flour", "Oil for frying"],
      "step": [
        "Slice eggplants, salt them to remove moisture, then coat in flour and fry until golden.",
        "In a baking dish, layer tomato sauce, eggplant slices, mozzarella, and parmesan.",
        "Repeat layers 3 or 4 times.",
        "Bake at 190°C for 30 minutes until the cheese is bubbling and browned."
      ]
    },
    "Mushroom Risotto": {
      "ing": ["300g Arborio rice", "1L Vegetable stock", "200g Porcini mushrooms", "Dry white wine", "Butter", "Shallots"],
      "step": [
        "Sauté shallots and mushrooms in butter. Add rice and toast for 2 minutes.",
        "Deglaze with a splash of white wine.",
        "Add warm stock one ladle at a time, stirring constantly until absorbed before adding more.",
        "Once the rice is al dente, stir in a large knob of butter and parmesan for the 'mantecatura' (creaminess)."
      ]
    },
    "Lasagna Bolognese": {
      "ing": ["Lasagna sheets", "Bolognese ragu", "Béchamel sauce", "Parmesan cheese"],
      "step": [
        "Slow-cook a meat ragu for at least 3 hours.",
        "Make a fresh white béchamel sauce with butter, flour, and milk.",
        "Layer sauce, pasta, ragu, and cheese in 5 or more layers.",
        "Bake until the top is crispy and the center is tender."
      ]
    }
  }
}
